ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/CONTROLSS_INPUTXBAR_CONTROLSS_502D0000h.xml
		<bitfield id="INPUTXBAR16_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR16_G1" acronym="CONTROLSS_INPUTXBAR16_G1" offset="1288" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR16_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR16_G2" acronym="CONTROLSS_INPUTXBAR16_G2" offset="1292" width="32" description="OUTPUTXBAR port selection - OUTPUTXBAR[15:0].">
		<bitfield id="INPUTXBAR16_G2_SEL" width="4" begin="3" end="0" resetval="0x0" description="Select input source:0      G2.0 selected..15    G2.15 selected" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR17_GSEL" acronym="CONTROLSS_INPUTXBAR17_GSEL" offset="1344" width="32" description="INPUT XBAR17 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR17_GSEL_GSEL" width="2" begin="1" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected2      G2 selected" range="1:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR17_G0" acronym="CONTROLSS_INPUTXBAR17_G0" offset="1348" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR17_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR17_G1" acronym="CONTROLSS_INPUTXBAR17_G1" offset="1352" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR17_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR17_G2" acronym="CONTROLSS_INPUTXBAR17_G2" offset="1356" width="32" description="OUTPUTXBAR port selection - OUTPUTXBAR[15:0].">
		<bitfield id="INPUTXBAR17_G2_SEL" width="4" begin="3" end="0" resetval="0x0" description="Select input source:0      G2.0 selected..15    G2.15 selected" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR18_GSEL" acronym="CONTROLSS_INPUTXBAR18_GSEL" offset="1408" width="32" description="INPUT XBAR18 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR18_GSEL_GSEL" width="2" begin="1" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected2      G2 selected" range="1:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR18_G0" acronym="CONTROLSS_INPUTXBAR18_G0" offset="1412" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR18_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR18_G1" acronym="CONTROLSS_INPUTXBAR18_G1" offset="1416" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR18_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR18_G2" acronym="CONTROLSS_INPUTXBAR18_G2" offset="1420" width="32" description="OUTPUTXBAR port selection - OUTPUTXBAR[15:0].">
		<bitfield id="INPUTXBAR18_G2_SEL" width="4" begin="3" end="0" resetval="0x0" description="Select input source:0      G2.0 selected..15    G2.15 selected" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR19_GSEL" acronym="CONTROLSS_INPUTXBAR19_GSEL" offset="1472" width="32" description="INPUT XBAR19 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR19_GSEL_GSEL" width="2" begin="1" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected2      G2 selected" range="1:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR19_G0" acronym="CONTROLSS_INPUTXBAR19_G0" offset="1476" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR19_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR19_G1" acronym="CONTROLSS_INPUTXBAR19_G1" offset="1480" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR19_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR19_G2" acronym="CONTROLSS_INPUTXBAR19_G2" offset="1484" width="32" description="OUTPUTXBAR port selection - OUTPUTXBAR[15:0].">
		<bitfield id="INPUTXBAR19_G2_SEL" width="4" begin="3" end="0" resetval="0x0" description="Select input source:0      G2.0 selected..15    G2.15 selected" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR20_GSEL" acronym="CONTROLSS_INPUTXBAR20_GSEL" offset="1536" width="32" description="INPUT XBAR20 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR20_GSEL_GSEL" width="2" begin="1" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected2      G2 selected" range="1:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR20_G0" acronym="CONTROLSS_INPUTXBAR20_G0" offset="1540" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR20_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR20_G1" acronym="CONTROLSS_INPUTXBAR20_G1" offset="1544" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR20_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR20_G2" acronym="CONTROLSS_INPUTXBAR20_G2" offset="1548" width="32" description="OUTPUTXBAR port selection - OUTPUTXBAR[15:0].">
		<bitfield id="INPUTXBAR20_G2_SEL" width="4" begin="3" end="0" resetval="0x0" description="Select input source:0      G2.0 selected..15    G2.15 selected" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR21_GSEL" acronym="CONTROLSS_INPUTXBAR21_GSEL" offset="1600" width="32" description="INPUT XBAR21 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR21_GSEL_GSEL" width="2" begin="1" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected2      G2 selected" range="1:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR21_G0" acronym="CONTROLSS_INPUTXBAR21_G0" offset="1604" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR21_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR21_G1" acronym="CONTROLSS_INPUTXBAR21_G1" offset="1608" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR21_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR21_G2" acronym="CONTROLSS_INPUTXBAR21_G2" offset="1612" width="32" description="OUTPUTXBAR port selection - OUTPUTXBAR[15:0].">
		<bitfield id="INPUTXBAR21_G2_SEL" width="4" begin="3" end="0" resetval="0x0" description="Select input source:0      G2.0 selected..15    G2.15 selected" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR22_GSEL" acronym="CONTROLSS_INPUTXBAR22_GSEL" offset="1664" width="32" description="INPUT XBAR22 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR22_GSEL_GSEL" width="2" begin="1" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected2      G2 selected" range="1:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR22_G0" acronym="CONTROLSS_INPUTXBAR22_G0" offset="1668" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR22_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR22_G1" acronym="CONTROLSS_INPUTXBAR22_G1" offset="1672" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR22_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR22_G2" acronym="CONTROLSS_INPUTXBAR22_G2" offset="1676" width="32" description="OUTPUTXBAR port selection - OUTPUTXBAR[15:0].">
		<bitfield id="INPUTXBAR22_G2_SEL" width="4" begin="3" end="0" resetval="0x0" description="Select input source:0      G2.0 selected..15    G2.15 selected" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR23_GSEL" acronym="CONTROLSS_INPUTXBAR23_GSEL" offset="1728" width="32" description="INPUT XBAR23 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR23_GSEL_GSEL" width="2" begin="1" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected2      G2 selected" range="1:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR23_G0" acronym="CONTROLSS_INPUTXBAR23_G0" offset="1732" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR23_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR23_G1" acronym="CONTROLSS_INPUTXBAR23_G1" offset="1736" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR23_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR23_G2" acronym="CONTROLSS_INPUTXBAR23_G2" offset="1740" width="32" description="OUTPUTXBAR port selection - OUTPUTXBAR[15:0].">
		<bitfield id="INPUTXBAR23_G2_SEL" width="4" begin="3" end="0" resetval="0x0" description="Select input source:0      G2.0 selected..15    G2.15 selected" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR24_GSEL" acronym="CONTROLSS_INPUTXBAR24_GSEL" offset="1792" width="32" description="INPUT XBAR24 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR24_GSEL_GSEL" width="2" begin="1" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected2      G2 selected" range="1:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR24_G0" acronym="CONTROLSS_INPUTXBAR24_G0" offset="1796" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR24_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR24_G1" acronym="CONTROLSS_INPUTXBAR24_G1" offset="1800" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR24_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR24_G2" acronym="CONTROLSS_INPUTXBAR24_G2" offset="1804" width="32" description="OUTPUTXBAR port selection - OUTPUTXBAR[15:0].">
		<bitfield id="INPUTXBAR24_G2_SEL" width="4" begin="3" end="0" resetval="0x0" description="Select input source:0      G2.0 selected..15    G2.15 selected" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR25_GSEL" acronym="CONTROLSS_INPUTXBAR25_GSEL" offset="1856" width="32" description="INPUT XBAR25 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR25_GSEL_GSEL" width="2" begin="1" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected2      G2 selected" range="1:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR25_G0" acronym="CONTROLSS_INPUTXBAR25_G0" offset="1860" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR25_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR25_G1" acronym="CONTROLSS_INPUTXBAR25_G1" offset="1864" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR25_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR25_G2" acronym="CONTROLSS_INPUTXBAR25_G2" offset="1868" width="32" description="OUTPUTXBAR port selection - OUTPUTXBAR[15:0].">
		<bitfield id="INPUTXBAR25_G2_SEL" width="4" begin="3" end="0" resetval="0x0" description="Select input source:0      G2.0 selected..15    G2.15 selected" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR26_GSEL" acronym="CONTROLSS_INPUTXBAR26_GSEL" offset="1920" width="32" description="INPUT XBAR26 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR26_GSEL_GSEL" width="2" begin="1" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected2      G2 selected" range="1:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR26_G0" acronym="CONTROLSS_INPUTXBAR26_G0" offset="1924" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR26_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR26_G1" acronym="CONTROLSS_INPUTXBAR26_G1" offset="1928" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR26_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR26_G2" acronym="CONTROLSS_INPUTXBAR26_G2" offset="1932" width="32" description="OUTPUTXBAR port selection - OUTPUTXBAR[15:0].">
		<bitfield id="INPUTXBAR26_G2_SEL" width="4" begin="3" end="0" resetval="0x0" description="Select input source:0      G2.0 selected..15    G2.15 selected" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR27_GSEL" acronym="CONTROLSS_INPUTXBAR27_GSEL" offset="1984" width="32" description="INPUT XBAR27 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR27_GSEL_GSEL" width="2" begin="1" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected2      G2 selected" range="1:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR27_G0" acronym="CONTROLSS_INPUTXBAR27_G0" offset="1988" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR27_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR27_G1" acronym="CONTROLSS_INPUTXBAR27_G1" offset="1992" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR27_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR27_G2" acronym="CONTROLSS_INPUTXBAR27_G2" offset="1996" width="32" description="OUTPUTXBAR port selection - OUTPUTXBAR[15:0].">
		<bitfield id="INPUTXBAR27_G2_SEL" width="4" begin="3" end="0" resetval="0x0" description="Select input source:0      G2.0 selected..15    G2.15 selected" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR28_GSEL" acronym="CONTROLSS_INPUTXBAR28_GSEL" offset="2048" width="32" description="INPUT XBAR28 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR28_GSEL_GSEL" width="2" begin="1" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected2      G2 selected" range="1:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR28_G0" acronym="CONTROLSS_INPUTXBAR28_G0" offset="2052" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR28_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR28_G1" acronym="CONTROLSS_INPUTXBAR28_G1" offset="2056" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR28_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR28_G2" acronym="CONTROLSS_INPUTXBAR28_G2" offset="2060" width="32" description="OUTPUTXBAR port selection - OUTPUTXBAR[15:0].">
		<bitfield id="INPUTXBAR28_G2_SEL" width="4" begin="3" end="0" resetval="0x0" description="Select input source:0      G2.0 selected..15    G2.15 selected" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR29_GSEL" acronym="CONTROLSS_INPUTXBAR29_GSEL" offset="2112" width="32" description="INPUT XBAR29 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR29_GSEL_GSEL" width="2" begin="1" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected2      G2 selected" range="1:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR29_G0" acronym="CONTROLSS_INPUTXBAR29_G0" offset="2116" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR29_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR29_G1" acronym="CONTROLSS_INPUTXBAR29_G1" offset="2120" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR29_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR29_G2" acronym="CONTROLSS_INPUTXBAR29_G2" offset="2124" width="32" description="OUTPUTXBAR port selection - OUTPUTXBAR[15:0].">
		<bitfield id="INPUTXBAR29_G2_SEL" width="4" begin="3" end="0" resetval="0x0" description="Select input source:0      G2.0 selected..15    G2.15 selected" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR30_GSEL" acronym="CONTROLSS_INPUTXBAR30_GSEL" offset="2176" width="32" description="INPUT XBAR30 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR30_GSEL_GSEL" width="2" begin="1" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected2      G2 selected" range="1:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR30_G0" acronym="CONTROLSS_INPUTXBAR30_G0" offset="2180" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR30_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR30_G1" acronym="CONTROLSS_INPUTXBAR30_G1" offset="2184" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR30_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR30_G2" acronym="CONTROLSS_INPUTXBAR30_G2" offset="2188" width="32" description="OUTPUTXBAR port selection - OUTPUTXBAR[15:0].">
		<bitfield id="INPUTXBAR30_G2_SEL" width="4" begin="3" end="0" resetval="0x0" description="Select input source:0      G2.0 selected..15    G2.15 selected" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR31_GSEL" acronym="CONTROLSS_INPUTXBAR31_GSEL" offset="2240" width="32" description="INPUT XBAR31 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR31_GSEL_GSEL" width="2" begin="1" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected2      G2 selected" range="1:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR31_G0" acronym="CONTROLSS_INPUTXBAR31_G0" offset="2244" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR31_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR31_G1" acronym="CONTROLSS_INPUTXBAR31_G1" offset="2248" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR31_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR31_G2" acronym="CONTROLSS_INPUTXBAR31_G2" offset="2252" width="32" description="OUTPUTXBAR port selection - OUTPUTXBAR[15:0].">
		<bitfield id="INPUTXBAR31_G2_SEL" width="4" begin="3" end="0" resetval="0x0" description="Select input source:0      G2.0 selected..15    G2.15 selected" range="3:0" rwaccess="R/W"/>
	</register>
</module>